'use strict';
console.log(10 + 10 + "10");
/*
1. 10 + 10 получаем 20
2. 20 + "10" получаем "2010"
*/
console.log(10 + "10" + 10);
/*
1. 10 + "10" получаем "1010"
2. "1010" + 10 получаем "101010"
*/
console.log(10 + 10 + +"10");
/*
1. 10 + 10 получаем 20
2. +"10" = 10
3. 20 + 10 получаем 30
*/
console.log(10 / -"");
/*
1. -"" = -0
2. 10 на -0 делить нельзя, получаем -Infinity
*/
console.log(10 / +"2,5");
/*
1. +"2,5" (неправильный разделитель дробной части), получаем NaN
2. 10 делить на NaN, получаем NaN
*/
